#+TITLE: RS Chapter 6 Simple Linear Regression
#+AUTHOR: Nooreen Dabbish

* Examples
** Example 6.2
*** Data Table, ex6_2
#+tblname: ex6_2
|  y |  x |
|----+----|
| 95 | 96 |
| 80 | 77 |
|  0 |  0 |
|  0 |  0 |
| 79 | 78 |
| 77 | 64 |
| 72 | 89 |
| 66 | 47 |
| 98 | 90 |
| 90 | 93 |
|  0 | 18 |
| 95 | 86 |
| 35 |  0 |
| 50 | 30 |
| 72 | 59 |
| 55 | 77 |
| 75 | 74 |
| 66 | 67 |

*** Analysis in R

**** Estimation of \Beta_0, \Beta_1
#+name: Example6_2Ra
#+BEGIN_SRC R :session *ch6* :var mydata=ex6_2 :exports none
  #inner product
n <- length(mydata[,"x"])
X <- matrix(mydata[,"x"], ncol=1, nrow=n)
Y <- matrix(mydata[,"y"], ncol=1, nrow=n)
beta1hat<- (t(X)%*%Y - length(X)*mean(X)*mean(Y))/(t(X)%*%X - length(X)*(mean(X))^2)
beta0hat<- mean(Y) - beta1hat*mean(X) 

#+END_SRC

#+RESULTS: Example6_2Ra
: 10.7269091498676

The prediction equation is: $$\hat{y} = SRC_R[:session *ch6* :results raw]{round(beta0hat,2)} +
SRC_R[:session *ch6* :results raw]{round(beta1hat,2)}
 x$$

** (Example 6.3) t-test

We want to test the hypothesis H_0: \beta_1 = 0.

#+name: Example6_2Rb
#+BEGIN_SRC R :session *ch6* :exports none


#calculation of sample variance s, note denominator! (n-2)
Yhat <- apply(X, 2, function(x){ beta1hat*x+beta0hat})
s <- sqrt((t(Y-Yhat)%*%(Y-Yhat))/(length(Yhat)-2))

#t calculating t.
tval <- beta1hat*sqrt(sum(apply(X, 2, function(x) (x-mean(X))^2)))/s


#+END_SRC

#+RESULTS: Example6_2Rb
: 8.80245574209067

Our t-value is SRC_R[:session *ch6* :results raw]{round(tval,2)}. It
is SRC_R[:session *ch6* :results raw]{pt(tval, length(X)-2)} 

**** 95% confidence interval for \beta_1

\[
\hat\beta_{1} \pm t_{.025,16}\frac{s}{\sqrt{\sum_{i=1}^{n} (x_i
-\bar{x})^2}}
\]


 #+BEGIN_SRC R :session *ch6* :exports none
pm <- abs((qt(.025,16)*s/sqrt(sum(apply(X,2, function(x) (x-mean(X))^2)))))
Bmin <- beta1hat -  abs(qt(.025,16)*s/sqrt(sum(apply(X,
2, function(x) (x-mean(X))**2))))
Bmax <- beta1hat + abs(qt(.025,16)*s/sqrt(sum(apply(X,
2, function(x) (x-mean(X))**2))))

 #+END_SRC

 #+RESULTS:
 : 1.08280698717206

 SRC_R[:session *ch6* :results raw]{round(beta1hat,2)} $\pm$
 SRC_R[:session *ch6* :results raw]{round(pm,2)}

This gives a range of \beta_1 from SRC_R[:session *ch6* :results raw]{round(Bmin,2)} to SRC_R[:session *ch6* :results raw]{round(Bmax,2)}.

** Coefficient of determination /r^2/ (Example 6.4)
 
 The cofficient of determination, $r^2$ is defined as $$r^2 =
 \frac{\mathrm{SSR}}{\mathrm{SST}} = \frac{\sum_{i=1}^n (\hat{y}_i -
 \bar{y})^2}{\sum_{i=1}^n ({y}_i - \bar{y})^2}$$
 

 #+BEGIN_SRC R :session *ch6* :exports none
 
Ymean <- rep(mean(Y), length(Y))
SSR <- t(Yhat - Ymean)%*%(Yhat - Ymean)
SST <- t(Y - Ymean)%*%(Y - Ymean)
coDet <- SSR/SST
 
 #+END_SRC

 #+RESULTS:
 : 0.828846302189104

 $r^2$ gives the proportion of variation in /y/ that is explained by
 the model (accounted for by regression on /x/).

 /r/ is the /sample correlation coefficient/ between x and y, here
 SRC_R[:session *ch6* :results raw]{round(sqrt(coDet),2)}


* Problems
 
